## Plan Result (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/198461)



<pre><code>Plan: 19 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.corpus_events_sqs_processor
  * aws_codedeploy_app.lambda_corpus_events
  * aws_codedeploy_deployment_group.lambda_corpus_events
  * aws_codestarnotifications_notification_rule.lambda_corpus_events_notifications
  * aws_iam_role.corpus_events_lambda_role
  * aws_iam_role_policy.corpus_events_lambda_execution_policy
  * aws_iam_role_policy_attachment.corpus_events_lambda_role_xray_write
  * aws_lambda_alias.corpus_events_sqs_processor
  * aws_lambda_event_source_mapping.corpus_events_sqs
  * aws_lambda_function.corpus_events_sqs_processor
  * aws_sns_topic_subscription.collection_events_sns_topic_subscription
  * aws_sns_topic_subscription.corpus_events_sns_topic_subscription
  * aws_sqs_queue.corpus_events
  * aws_sqs_queue.corpus_events_deadletter
  * aws_sqs_queue.corpus_events_sns_topic_dlq
  * aws_sqs_queue_policy.collection_events_sns_topic_dlq_policy
  * aws_sqs_queue_policy.collection_events_sqs_policy
  * aws_sqs_queue_policy.corpus_events_sns_topic_dlq_policy
  * aws_sqs_queue_policy.corpus_events_sqs_policy



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.collection_events_sns_topic_dlq_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "collection_events_sns_topic_dlq_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.collection_events_sqs_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "collection_events_sqs_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.corpus_events_lambda_execution_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "corpus_events_lambda_execution_policy" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "sqs:DeleteMessage*",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage*",
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "es:ESHttp*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/_bulk",
              + "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_de/_bulk",
              + "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_en/_bulk",
              + "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_es/_bulk",
              + "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_fr/_bulk",
              + "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_it/_bulk",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod",
              + "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod/*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
        }
    }

  # data.aws_iam_policy_document.corpus_events_sns_topic_dlq_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "corpus_events_sns_topic_dlq_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEvents",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.corpus_events_sqs_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "corpus_events_sqs_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEvents",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_log_group.corpus_events_sqs_processor will be created
  + resource "aws_cloudwatch_log_group" "corpus_events_sqs_processor" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/UserListSearch-Prod-CorpusIndexer"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
    }

  # aws_codedeploy_app.lambda_corpus_events will be created
  + resource "aws_codedeploy_app" "lambda_corpus_events" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "Lambda"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "UserListSearch-Prod-CorpusIndexer"
      + tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
    }

  # aws_codedeploy_deployment_group.lambda_corpus_events will be created
  + resource "aws_codedeploy_deployment_group" "lambda_corpus_events" {
      + app_name                    = "UserListSearch-Prod-CorpusIndexer"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.LambdaAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "UserListSearch-Prod-CorpusIndexer"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = "arn:aws:iam::996905175585:role/UserListSearch-Prod-LambdaCodeDeployRole"
      + tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }
    }

  # aws_codestarnotifications_notification_rule.lambda_corpus_events_notifications will be created
  + resource "aws_codestarnotifications_notification_rule" "lambda_corpus_events_notifications" {
      + arn            = (known after apply)
      + detail_type    = "BASIC"
      + event_type_ids = [
          + "codedeploy-application-deployment-failed",
        ]
      + id             = (known after apply)
      + name           = "UserListSearch-Prod-CorpusIndexer"
      + resource       = "arn:aws:codedeploy:us-east-1:996905175585:application:UserListSearch-Prod-CorpusIndexer"
      + status         = "ENABLED"
      + tags_all       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }

      + target {
          + address = "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot"
          + status  = (known after apply)
          + type    = "SNS"
        }
    }

  # aws_iam_role.corpus_events_lambda_role will be created
  + resource "aws_iam_role" "corpus_events_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "UserListSearch-Prod-CorpusEventsLambdaExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
      + tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.corpus_events_lambda_execution_policy will be created
  + resource "aws_iam_role_policy" "corpus_events_lambda_execution_policy" {
      + id          = (known after apply)
      + name        = "UserListSearch-Prod-CorpusEventsAccessPolicy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.corpus_events_lambda_role_xray_write will be created
  + resource "aws_iam_role_policy_attachment" "corpus_events_lambda_role_xray_write" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess"
      + role       = "UserListSearch-Prod-CorpusEventsLambdaExecutionRole"
    }

  # aws_lambda_alias.corpus_events_sqs_processor will be created
  + resource "aws_lambda_alias" "corpus_events_sqs_processor" {
      + arn              = (known after apply)
      + function_name    = "UserListSearch-Prod-CorpusIndexer"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "DEPLOYED"
    }

  # aws_lambda_event_source_mapping.corpus_events_sqs will be created
  + resource "aws_lambda_event_source_mapping" "corpus_events_sqs" {
      + batch_size                         = 10
      + enabled                            = true
      + event_source_arn                   = (known after apply)
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 300
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + uuid                               = (known after apply)
    }

  # aws_lambda_function.corpus_events_sqs_processor will be created
  + resource "aws_lambda_function" "corpus_events_sqs_processor" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "index.js.zip"
      + function_name                  = "UserListSearch-Prod-CorpusIndexer"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = 1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Eopc/xVkmMfKAArRzCQpnAHkjzLLOwMK5dl0oKcStq0="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
      + tags_all                       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
      + timeout                        = 500
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "NODE_ENV"                  = "production"
              + "SENTRY_DSN"                = (sensitive value)
              + "SQS_USER_ITEMS_DELETE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete"
              + "SQS_USER_ITEMS_UPDATE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate"
              + "SQS_USER_LIST_IMPORT_URL"  = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport"
              + "USER_LIST_SEARCH_URI"      = "https://user-list-search.readitlater.com"
            }
        }

      + tracing_config {
          + mode = "Active"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0bab147168eae0b8d",
            ]
          + subnet_ids                  = (sensitive value)
          + vpc_id                      = (known after apply)
        }
    }

  # aws_sns_topic_subscription.collection_events_sns_topic_subscription will be created
  + resource "aws_sns_topic_subscription" "collection_events_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents"
    }

  # aws_sns_topic_subscription.corpus_events_sns_topic_subscription will be created
  + resource "aws_sns_topic_subscription" "corpus_events_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEvents"
    }

  # aws_sqs_queue.corpus_events will be created
  + resource "aws_sqs_queue" "corpus_events" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "UserListSearch-Prod-CorpusEvents"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
      + tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # aws_sqs_queue.corpus_events_deadletter will be created
  + resource "aws_sqs_queue" "corpus_events_deadletter" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "UserListSearch-Prod-CorpusEvents-Deadletter"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.corpus_events_sns_topic_dlq will be created
  + resource "aws_sqs_queue" "corpus_events_sns_topic_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "UserListSearch-Prod-CorpusIndexEvents-SNS-Topic-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
      + tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-userlistsearch"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "UserListSearch"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.collection_events_sns_topic_dlq_policy will be created
  + resource "aws_sqs_queue_policy" "collection_events_sns_topic_dlq_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # aws_sqs_queue_policy.collection_events_sqs_policy will be created
  + resource "aws_sqs_queue_policy" "collection_events_sqs_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # aws_sqs_queue_policy.corpus_events_sns_topic_dlq_policy will be created
  + resource "aws_sqs_queue_policy" "corpus_events_sns_topic_dlq_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # aws_sqs_queue_policy.corpus_events_sqs_policy will be created
  + resource "aws_sqs_queue_policy" "corpus_events_sqs_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"80d31d49-f724-4fb9-8eb2-bed94b92fc95","JobName":"user-list-search_infrastructure_plan_prod","PRNumber":575,"Program":"tfcmt","SHA1":"34845069880137ad87b9003b368c58f7149defb8","Target":"user-list-search-cdk","Vars":{}} -->